org/wiki/terminal-tips.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t
#+TYPE: wiki
#+LAYOUT: post
#+AUTHOR: carltonf
#+DATE: 2015-08-07 Fri 17:35
#+TITLE: Terminal Tips
#+DESCRIPTION: 
#+TAGS: terminal,tips
#+CATEGORIES: 

* Colors in Terminal
Basically, you need to use the following pattern for output string that need
colors. For exact color code, see below:

: printf("\x1b[%sm%s\x1b[0m", color_code, str-content);
** Simple table

The colors in the table below should be useful in most terminals.

#+BEGIN_SRC text

  Black       0;30     Dark Gray     1;30
  Blue        0;34     Light Blue    1;34
  Green       0;32     Light Green   1;32
  Cyan        0;36     Light Cyan    1;36
  Red         0;31     Light Red     1;31
  Purple      0;35     Light Purple  1;35
  Brown       0;33     Yellow        1;33
  Light Gray  0;37     White         1;37

  and for background colors, the num is 40 to 47
#+END_SRC

** A simple python script to show what's possible

[[http://stackoverflow.com/questions/287871/print-in-terminal-with-colors-using-python][Reference]].

#+BEGIN_SRC python
  def print_format_table():
      """
      prints table of formatted text format options
      """
      for style in xrange(8):
          for fg in xrange(30,38):
              s1 = ''
              for bg in xrange(40,48):
                  format = ';'.join([str(style), str(fg), str(bg)])
                  s1 += '\x1b[%sm %s \x1b[0m' % (format, format)
              print s1
          print '\n'

  print_format_table()
#+END_SRC

** References

- Reader-friendly Reference
  [[http://jafrog.com/2013/11/23/colors-in-terminal.html][Color in Terminal]]

- The Authortive Source
  [[http://en.wikipedia.org/wiki/ANSI_escape_code][ANSI Escape Code]]

